In [1]:
import numpy as np
import pandas as pd

In [2]:
df1 = pd.DataFrame({
    'id' : list('abcdef'),
    'name' : ['Alice', 'Bob', 'Charlie', 'David', 'Esther', 'Fanny'],
    'age' : [34, 36, 30, 29, 32, 36]
})

In [3]:
df1

  id     name  age
0  a    Alice   34
1  b      Bob   36
2  c  Charlie   30
3  d    David   29
4  e   Esther   32
5  f    Fanny   36

In [5]:
# Output the third row of the transposed data
df2 = df1.T

In [6]:
df2

          0    1        2      3       4      5
id        a    b        c      d       e      f
name  Alice  Bob  Charlie  David  Esther  Fanny
age      34   36       30     29      32     36

In [7]:
df2[2]

id            c
name    Charlie
age          30
Name: 2, dtype: object

In [9]:
df2.loc['age']
# return Series

0    34
1    36
2    30
3    29
4    32
5    36
Name: age, dtype: object

In [11]:
df2.loc[['age']] #DataFrame

      0   1   2   3   4   5
age  34  36  30  29  32  36

In [12]:
df2.iloc[[2]]

      0   1   2   3   4   5
age  34  36  30  29  32  36

In [14]:
df2[2:]

      0   1   2   3   4   5
age  34  36  30  29  32  36

In [15]:
df1

  id     name  age
0  a    Alice   34
1  b      Bob   36
2  c  Charlie   30
3  d    David   29
4  e   Esther   32
5  f    Fanny   36

In [17]:
df1.iloc[6] = ['g', 'john', 19]

IndexError: iloc cannot enlarge its target object

In [18]:
df1.loc[6] = ['g', 'john', 19]

In [19]:
df1

  id     name  age
0  a    Alice   34
1  b      Bob   36
2  c  Charlie   30
3  d    David   29
4  e   Esther   32
5  f    Fanny   36
6  g     john   19

In [20]:
# delete the third row (del can't delete a row)
del df1.loc[2]

AttributeError: __delitem__

In [21]:
df3 = df1.T

In [22]:
df3

          0    1        2      3       4      5     6
id        a    b        c      d       e      f     g
name  Alice  Bob  Charlie  David  Esther  Fanny  john
age      34   36       30     29      32     36    19

In [23]:
df3[2]

id            c
name    Charlie
age          30
Name: 2, dtype: object

In [24]:
del df3[2]

In [25]:
df3

          0    1      3       4      5     6
id        a    b      d       e      f     g
name  Alice  Bob  David  Esther  Fanny  john
age      34   36     29      32     36    19

In [26]:
df4 = df3.T
df4

  id    name age
0  a   Alice  34
1  b     Bob  36
3  d   David  29
4  e  Esther  32
5  f   Fanny  36
6  g    john  19

In [29]:
# Find the ages of Bob and David.
df1.loc[[1,3]].age

1    36
3    29
Name: age, dtype: int64